In [161]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import pandas as pd


connection_str = "mysql+pymysql://root:root@localhost/Books"

In [162]:
engine = create_engine(connection_str)

In [163]:
#create_database(connection_str)

In [164]:
#database_exists(connection_str)

In [165]:
if database_exists(connection_str) == False: create_database(connection_str)
else: print('The database already exists.')

The database already exists.

In [166]:
#df = pd.read_csv('data/data.csv')

In [167]:
#df.head()

In [168]:
#df.to_sql('books', engine, if_exists = 'replace')

In [169]:
#q = """SELECT * FROM books LIMIT 5"""

#pd.read_sql(q, engine)

![books model](Data/books.png)

In [170]:
df_users = pd.read_csv('Data/users.csv')
df_users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [171]:
df_users.to_sql('users', engine, if_exists = 'replace')

3

In [172]:
df_books = pd.read_csv('Data/books.csv')
df_books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [173]:
df_books.to_sql('books', engine, if_exists = 'replace')

6

In [174]:
df_authors = pd.read_csv('Data/users.csv')
df_authors.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [175]:
df_authors.to_sql('authors', engine, if_exists = 'replace')

3

In [176]:
df_favorites = pd.read_csv('Data/favorites.csv')
df_favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [177]:
df_favorites.to_sql('favorites', engine, if_exists = 'replace')

7

In [178]:
q2 = """SHOW TABLES"""

pd.read_sql(q2, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [179]:
q3 = """SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));"""

pd.read_sql(q3, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1